recept/src/Documents/АрбитражнаяПроба/АрбитражнаяПроба.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>АрбитражнаяПроба</name>
  <basedOn>Document.Рецептуры</basedOn>
  <registerRecords>InformationRegister.АрбитражнаяПроба</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.Рецептуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Партия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыАрбитражнойПробы</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

recept/src/InformationRegisters/АрбитражнаяПроба/АрбитражнаяПроба.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АрбитражнаяПроба</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыАрбитражнойПробы</types>
    </type>
  </resources>
  <dimensions>
    <name>ДокументОснованияПробы</name>
    <type>
      <types>DocumentRef.Рецептуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

recept/src/Documents/АрбитражнаяПроба/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Рецептуры") Тогда
		// Заполнение шапки
		Наименование = ДанныеЗаполнения.Наименование;
		Партия = ДанныеЗаполнения.Номер;
		ДокументОснование = ДанныеЗаполнения.Ссылка;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр АрбитражнаяПроба
	Движения.АрбитражнаяПроба.Записывать = Истина;
	Движение = Движения.АрбитражнаяПроба.Добавить();
	Движение.Период = Дата;
	Движение.ДокументОснованияПробы = ДокументОснование;
	Движение.Статус = Статус;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
